{ 
  "links": [
    {
      "url": "#",
      "text": "Lofts at River East"
    },
    {
      "url": "#",
      "text": "Axis Apartments"
    },
    {
      "url": "#",
      "text": "Arrive Streeterville Apartments"
    },
    {
      "url": "#",
      "text": "Aston Chicago Apartments"
    },
    {
      "url": "#",
      "text": "Cityfront Place Apartments"
    },
    {
      "url": "#",
      "text": "500 Lake Shore Drive Apartments"
    },
    {
      "url": "#",
      "text": "420 East Ohio Apartments"
    },
    {
      "url": "#",
      "text": "The Streeter Apartments"
    },
    {
      "url": "#",
      "text": "Lake Shore Plaza Apartments"
    },
    {
      "url": "#",
      "text": "Moment Apartments"
    },
    {
      "url": "#",
      "text": "Atwater Apartments"
    },
    {
      "url": "#",
      "text": "Optima Signature Apartments"
    },
    {
      "url": "#",
      "text": "One Bennett park Apartments"
    },
    {
      "url": "#",
      "text": "North Water Apartments"
    },
    {
      "url": "#",
      "text": "465 North Park Apartments"
    },
    {
      "url": "#",
      "text": "Sienna Apartments"
    }
  ],
  "title": "General",
  "description": "Streeterville apartments are considered among the most luxurious in Chicago, and for good reason. With development continuing, Streeterville is home to many of the new luxury apartments in Chicago. Luxury apartments in Streeterville offer an ideal location for those seeking luxury apartments with convenient access to the Loop, River North, Michigan Avenue and the lakefront.",
  "hidedescription": "The Streeterville neighborhood is a giant swath of territory sandwiched between the southern half of the Magnificent Mile and the shores of Lake Michigan. It's city living, pure and simple, and it's pretty much all here. The Streeterville neighborhood includes a generous array of high-rise and mid-rise condo and apartments, many of them new construction buildings, as well as the Chicago Tribune Tower, Navy Pier, NBC Tower and a string of hotels.  Streeterville is also home to the Museum of Contemporary Art, the massive sprawling Northwestern University and Northwestern Hospital Campus. For Streeterville apartments, convenience is the name of the game.  It has a relatively small footprint so getting around this neighborhood is easy.  Renters in Streeterville will find shops ranging from the upscale to the ritzy, and the restaurants range from fast food to casual dining to steak houses to haute cuisine near Streeterville apartments. Streeterville also plays host to a 21-screen multiplex, several health clubs and plenty of gourmet grocery options. If you love to walk, Streeterville will suit you well.  Parking is expensive, and walking is the easiest option for getting around.  Since this neighborhood is bounded by the Chicago River and Lake Michigan your backyard is the Chicago Riverwalk, the Lakefront Trail, Navy Pier, Olive Park, Jane Addams Park, Lakeshore Park, and Ohio Street Beach.  If you walk across the Chicago River to the south, you will quickly find yourself at Millennium Park to enjoy the afternoon. In the summer, apartment renters in Streeterville are never more than a short walk to the beach, where you can pick up a trail that extends past the Museum of Science and Industry on the south and extends up through to Evanston on the north.Almost all of the Streeterville luxury apartment buildings and condo buildings with rentals are loaded with amenities.  Even the older buildings in this neighborhood have robust amenities that could spoil anyone.  The newer buildings have all of the amenities of any luxury building in Chicago.  Many of the buildings in Streeterville have some of the best views in the city with unobstructed lake and city views. Streeterville Chicago has a wide range of apartment sizes.  There are always plenty of studio apartments, 1 bedroom apartments and 2 bedroom apartments available, and great options for larger 3 bedroom and 4 bedroom apartments.  The larger units won’t be affordable, but they are filled with top-of-the-line finishes and amenities.  Options will range from condo buildings, penthouses, apartment buildings, lofts and single family homes along the Ogden Slip of the Chicago River. Higher learning institutions that call Streeterville home include Northwestern University Pritzker School of Law, Northwestern University Feinberg School of Medicine, Northwestern University Kellogg Business School, and University of Chicago Booth School of Business at the Gleacher Center on the Chicago River.  Just across Michigan Avenue you will find Loyola University and law School as part of the Loyola University Water Tower Campus.",
  "subtitle": "Popular Streeterville Apartment Buildings",
  "galleryimg": [
    {
      "gallery_img": "https://domu-live.s3.amazonaws.com/styles/neighborhood_gallery_large/s3/neighborhood-gallery-images/Lofts-at-River-East-apartments-Ogden-Slip-Streeterville_gallery%2812%29.jpg"
    },
    {
      "gallery_img": "https://domu-live.s3.amazonaws.com/styles/neighborhood_gallery/s3/neighborhood-gallery-images/680-N-Lake-Shore-Dr-tower-Streeterville_gallery%2813%29.jpg"
    },
    {
      "gallery_img": "https://domu-live.s3.amazonaws.com/styles/neighborhood_gallery/s3/neighborhood-gallery-images/family-waiting-on-bicycles-at-traffic-light-E-Ohio-St-Streeterville_gallery%286%29.jpg"
    },
    {
      "gallery_img": "https://domu-live.s3.amazonaws.com/styles/neighborhood_gallery/s3/neighborhood-gallery-images/flowers-garden-shop-displays-customers-browsing-E-Ohio-St-Streeterville_gallery%287%29.jpg"
    },
    {
      "gallery_img": "https://domu-live.s3.amazonaws.com/styles/neighborhood_gallery/s3/neighborhood-gallery-images/paved-driveway-turnaround-The-Streeter-apartments-Streeterville_gallery%2814%29.jpg"
    },
    {
      "gallery_img": "https://domu-live.s3.amazonaws.com/styles/neighborhood_gallery/s3/neighborhood-gallery-images/Tribune-Tower-plaza-walkway-to-Navy-Pier-Streeterville_gallery%283%29.jpg"
    },
    {
      "gallery_img": "https://domu-live.s3.amazonaws.com/styles/neighborhood_gallery/s3/neighborhood-gallery-images/Wrigley-Building-Tribune-Tower-exterior-N-Michigan-Ave-Streeterville_gallery%282%29.jpg"
    }
  ]
}


















